In [1]:
import pandas as pd

In [2]:
# Read .csv files of household income and mobility by zip code from census
file = "./Resources/Census_Data/household_income_census.csv"
household_income = pd.read_csv(file)

file2 = "./Resources/Census_Data/mobility_census.csv"
mobility = pd.read_csv(file2)

In [3]:
#Drop first column from household_income dataframe
household_income = household_income.drop(columns=["geoid"])
household_income.head()

      name  B19013001  B19013001, Error
0  Florida    55660.0             220.0
1    32003    94154.0           13447.0
2    32008    33663.0            6751.0
3    32009    68929.0           10413.0
4    32011    63772.0            5213.0

In [4]:
#Drop error columns from household_income dataframe
household_income = household_income.drop(columns=["B19013001, Error"])

In [5]:
household_income.head()

      name  B19013001
0  Florida    55660.0
1    32003    94154.0
2    32008    33663.0
3    32009    68929.0
4    32011    63772.0

In [6]:
#Look at mobility dataframe
mobility.head()

,geoid,name,B07003001,"B07003001, Error",B07003002,"B07003002, Error",B07003003,"B07003003, Error",B07003004,"B07003004, Error",...,B07003014,"B07003014, Error",B07003015,"B07003015, Error",B07003016,"B07003016, Error",B07003017,"B07003017, Error",B07003018,"B07003018, Error"
0,01000US,United States,320984519,12103,157985702,9703,162998817,11328,275328008,182093,...,3799158,20414,3675880,22226,2063988,17801,1040035,9061,1023953,11085
1,04000US12,Florida,20691583,2955,10113248,2801,10578335,2416,17479613,23723,...,291709,5487,296039,5728,226110,6556,111108,3697,115002,3720
2,86000US32003,32003,28564,1612,14221,997,14343,812,23356,1612,...,800,327,835,433,332,263,112,125,220,189
3,86000US32008,32008,4326,776,2070,416,2256,445,4036,744,...,13,21,0,14,14,25,3,5,11,25
4,86000US32009,32009,3573,289,1834,252,1739,186,3426,302,...,0,14,5,8,0,14,0,14,0,14

In [7]:
#Drop first column from mobility dataframe
mobility = mobility.drop(columns=["geoid"])
mobility.head()

,name,B07003001,"B07003001, Error",B07003002,"B07003002, Error",B07003003,"B07003003, Error",B07003004,"B07003004, Error",B07003005,...,B07003014,"B07003014, Error",B07003015,"B07003015, Error",B07003016,"B07003016, Error",B07003017,"B07003017, Error",B07003018,"B07003018, Error"
0,United States,320984519,12103,157985702,9703,162998817,11328,275328008,182093,135064244,...,3799158,20414,3675880,22226,2063988,17801,1040035,9061,1023953,11085
1,Florida,20691583,2955,10113248,2801,10578335,2416,17479613,23723,8507345,...,291709,5487,296039,5728,226110,6556,111108,3697,115002,3720
2,32003,28564,1612,14221,997,14343,812,23356,1612,11544,...,800,327,835,433,332,263,112,125,220,189
3,32008,4326,776,2070,416,2256,445,4036,744,1981,...,13,21,0,14,14,25,3,5,11,25
4,32009,3573,289,1834,252,1739,186,3426,302,1773,...,0,14,5,8,0,14,0,14,0,14

In [8]:
#Drop out error columns
mobility = mobility.drop(columns=["B07003001, Error", "B07003002, Error", "B07003003, Error", "B07003004, Error", "B07003005, Error", "B07003006, Error", "B07003007, Error", "B07003008, Error", "B07003009, Error", "B07003010, Error", "B07003011, Error", "B07003012, Error", "B07003013, Error", "B07003014, Error", "B07003015, Error", "B07003016, Error", "B07003017, Error", "B07003018, Error"])
mobility.head()

,name,B07003001,B07003002,B07003003,B07003004,B07003005,B07003006,B07003007,B07003008,B07003009,B07003010,B07003011,B07003012,B07003013,B07003014,B07003015,B07003016,B07003017,B07003018
0,United States,320984519,157985702,162998817,275328008,135064244,140263764,25736976,12692364,13044612,10380509,5389901,4990608,7475038,3799158,3675880,2063988,1040035,1023953
1,Florida,20691583,10113248,10578335,17479613,8507345,8972268,1753656,859791,893865,644456,343295,301161,587748,291709,296039,226110,111108,115002
2,32003,28564,14221,14343,23356,11544,11812,1625,877,748,1616,888,728,1635,800,835,332,112,220
3,32008,4326,2070,2256,4036,1981,2055,88,15,73,175,58,117,13,13,0,14,3,11
4,32009,3573,1834,1739,3426,1773,1653,142,61,81,0,0,0,5,0,5,0,0,0

In [9]:
mobility_rate = 1- (mobility.B07003004/mobility.B07003001)
mobility["mobility_rate"]=mobility_rate
mobility.head()

,name,B07003001,B07003002,B07003003,B07003004,B07003005,B07003006,B07003007,B07003008,B07003009,B07003010,B07003011,B07003012,B07003013,B07003014,B07003015,B07003016,B07003017,B07003018,mobility_rate
0,United States,320984519,157985702,162998817,275328008,135064244,140263764,25736976,12692364,13044612,10380509,5389901,4990608,7475038,3799158,3675880,2063988,1040035,1023953,0.142239
1,Florida,20691583,10113248,10578335,17479613,8507345,8972268,1753656,859791,893865,644456,343295,301161,587748,291709,296039,226110,111108,115002,0.155231
2,32003,28564,14221,14343,23356,11544,11812,1625,877,748,1616,888,728,1635,800,835,332,112,220,0.182327
3,32008,4326,2070,2256,4036,1981,2055,88,15,73,175,58,117,13,13,0,14,3,11,0.067037
4,32009,3573,1834,1739,3426,1773,1653,142,61,81,0,0,0,5,0,5,0,0,0,0.041142

In [11]:
mobility = mobility.filter(["name", "mobility_rate"], axis=1)
mobility.head()

            name  mobility_rate
0  United States       0.142239
1        Florida       0.155231
2          32003       0.182327
3          32008       0.067037
4          32009       0.041142

In [12]:
mobility = mobility.dropna()
mobility = mobility.drop_duplicates()
household_income = household_income.dropna()
household_income = household_income.drop_duplicates()

In [13]:
mobility.to_csv('./Resources/Census_Data/mobility_census_clean.csv')
household_income.to_csv('./Resources/Census_Data/household_income_census_clean.csv')

In [16]:

from sqlalchemy import create_engine
e = create_engine('sqlite:///sqlite.db')  # pass your db url

mobility.to_sql(name='mobility_slim', con=e)
#household_income.to_sql(name='household_income', con=e)

ValueError: Table 'mobility_slim' already exists.

In [ ]:
git status